[
    {
        "id": 1,
        "titulo": "OrganoTimes",
        "texto": "> Link: <https://organo-hoy6.vercel.app> \n\n O site OrganoTimes é uma aplicação web que permite o cadastro e organização de pessoas por times de futebol. O design é interativo, possibilitando a criação de novos times, a personalização de cores dos times, e a adição, exclusão ou favoritação de jogadores. \n\n ### OrganoTimes \n\n Este site tem como intuito poder organizar times e jogadores, onde é possivel a criação de times, feita a escolha da cor, podendo tambem favotirar seus jogadores preferidos e tambem deletar caso queira. O cadastro dos jogadores é bem simples, basta colocar o Nome, apelido, indicar um link para a pesquisa da imagem e selecionar o time, como é mostrado abaixo:\n \n ![print da tela mostrando os times](/assets/posts/1/mostrandoTimes.png) \n\n ### Alteração dos times e jogadores \n\n Como o projeto ainda não foi incluido um banco de dados, adicionei alguns jogadores para tornar a visualização mais clara quando o site for acessado. Dessa forma, é possível demonstrar funcionalidades como exclusão de jogadores, mudança de cor dos times e a opção de favoritar jogadores, conforme mostrado abaixo. \n \n ![print da tela mostrando os times](/assets/posts/1/mostrandoTimesVideo.gif) \n\n ### Cadastro do time e cadastro do jogador \n\n O cadastro de times e jogadores neste projeto tem como objetivo proporcionar uma experiência mais organizada e personalizada para o usuário. Através do formulário de cadastro de times, como mostrado no GIF, o usuário pode criar equipes com nomes e cores específicas, o que facilita a identificação e diferenciação visual. Isso também oferece flexibilidade na personalização dos times de acordo com as preferências individuais. \n\nJá o cadastro de jogadores permite que o usuário insira informações como nome, apelido e uma imagem representativa de cada jogador, além de associá-los diretamente a um time. Esse processo é essencial para criar uma lista organizada de jogadores, possibilitando ações futuras, como favoritar ou excluir um jogador específico, tudo de maneira simples e eficiente. Assim, ambos os cadastros se complementam, possibilitando que o usuário tenha um controle total sobre os jogadores e times, além de oferecer uma interface clara e funcional para gerenciar essas informações. ![print da tela mostrando os times](/assets/posts/1/timeEjogador.gif) O [OrganoTimes](https://organo-hoy6.vercel.app) oferece uma solução prática e eficiente para quem deseja organizar times e jogadores de forma intuitiva. Com a possibilidade de criar times personalizados, escolher cores distintas e cadastrar jogadores com informações detalhadas, o sistema permite uma gestão clara e funcional, facilitando a visualização e o controle das equipes. O uso do OrganoTimes é ideal para quem busca otimizar o gerenciamento de times, seja em pequenos eventos, campeonatos informais ou até mesmo para fins recreativos. Ele oferece uma interface amigável e fácil de usar, além de permitir ações rápidas, como favoritar ou excluir jogadores e alterar as cores dos times. Tudo isso torna o OrganoTimes uma ferramenta valiosa para manter as informações organizadas em um só lugar, garantindo praticidade e eficiência. \n\n Caso queira baixar o código fonte tanto para uso pessoal ou melhorias, basta clicar no link [Organo](https://github.com/Peangelo/Organo). \n\n"
    }
]